topping_type_name_to_topping = {
    "Топпинг": {
        "Белый соус": 200,
        "Карамельный сироп": 100,
        "Кленовый сироп": 200,
        "Клубничный сироп": 300,
        "Черничный сироп": 350,
        "Молочный шоколад": 200,
    },
    "Ягоды": {
        "Ежевика": 400,
        "Малина": 300,
        "Голубика": 450,
        "Клубника": 500,
    },
    "Декор": {
        "Фисташки": 300,
        "Безе": 400,
        "Фундук": 300,
        "Пекан": 300,
        "Маршмеллоу": 200, 
        "Марципан": 200
    },
    "Надпись": {
        "Поздравляю!": 500,
    }
}

layer_count_to_price = {
    "1 уровень": 400,
    "2 уровня": 750,
    "3 уровня": 1100,
}

shape_name_to_price = {
    "Квадрат": 600,
    "Круг": 400,
    "Прямоугольник": 1000,
}
